# Taps
tap "homebrew/bundle"

# CLI tools
brew "autojump"
brew "git"
brew "gh"               # GitHub CLI
brew "signal-cli"       # Signal messenger CLI for MCP integration

# Modern CLI (better defaults)
brew "starship"         # Beautiful prompt
brew "fzf"              # Fuzzy finder (Ctrl+R)
brew "eza"              # Better ls with icons
brew "bat"              # Better cat with syntax highlighting
brew "ripgrep"          # Faster grep (rg)

# Python
brew "python"
brew "uv"           # Fast Python package manager
brew "ruff"         # Python linter & formatter

# Node.js / TypeScript
brew "node"
brew "pnpm"         # Fast package manager
brew "typescript"

# Applications (casks)
cask "google-chrome"
cask "rectangle"
cask "ghostty"          # GPU-accelerated terminal (replaces iTerm2)
cask "zed"

# Fonts
cask "font-jetbrains-mono-nerd-font"

# Optional: uncomment if you want these
# cask "docker"
# cask "slack"
